{
    "broadArea": {
	"name": "Computer Science",
	"link": "http://vlab.co.in/broad-area-computer-science-and-engineering"
    },
    "lab": "Data Structures 1",
    "baseUrl": "http://lab1.vlabs.ac.in/",
	"introduction": "Welcome to the Data Structures Lab",
	"experiment-sections":[
		{
			"sect-name": "Linked Lists",
			"experiments": [
				{
					"name": "Poly Arithmetic",
					"repo": "https://gitlab.com/vlead-projects/experiments/ds/poly-arithmetic-summer-2019",
					"branch": "master"
				},
				{
					"name": "Quicksort",
					"repo": "https://gitlab.com/vlead-projects/experiments/ds/quicksort-summer-2019",
					"branch": "master"
				}
			]		
		},
		{
			"sect-name": "Trees",
			"experiments": [
			]		
		}
	],
    "targetAudience": {
	"UG": [
	    "B. Tech./ B.E in Civil Engineering"
	],
	"PG": [
	    "MS/Ph. D. Beginners in Civil Engineering and related topics"
	]
    },
    "objective": "Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system. Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.  Many of our daily life activity depends on fluid machinery so it is important to understand the functioning principles and characteristics of such machinery from an engineering point of view. This lab focuses on giving the user an idea about practical behaviour of such machines before performing operations on a real system.",
    "courseAlignment": {
	"description": "The syllabi of this lab aligns to the following universities in India.",
	"universities": [
	    "Visvesvaraya Technological University Karnataka",
	    "National Institute of Technology Karnataka Karnataka",
	    "Anna University Tamil Nadu",
	    "SRM University Delhi - NCR Sonepat Haryana",
	    "University of Kerala Kerala",
	    "APJ Abdul Kalam Technological University Kerala",
	    "CUSAT Kerala"
	]
    }
}
